import { அங்கீகரிக்கப்பட்ட_உறுப்படி_வகை } from "@lassi-js/kili";
import {
  இலக்கு_மொழி_நெடுவரிசை_அடையாளம்,
  சாபி_நெடுவரிசை_அடையாளம்,
  மூல்_உரை_நெடுவரிசை_அடையாளம்,
  மூல்_மொழி_நெடுவரிசை_அடையாளம்,
  மொழிபெயர்ப்பு_நெடுவரிசை_அடையாளம்,
} from "./மாறிலிகள்.js";

export type மூல்_மொழிப்பெயர்ப்பு_வகை = {
  clef: string;
  langueCible: string;
  traduction: string;
};

// மொழிபெயர்ப்பு மரங்கள் மட்டும் வடிவூட்டங்கள்
export type மொழி_மொழிபெயர்ப்பு_அகராதி_வகை = {
  [மொழி: string]: string;
};
export type மொழிபெயர்ப்பு_அகராதி_வகை = {
  [சாபி: string]: மொழி_மொழிபெயர்ப்பு_அகராதி_வகை;
};

export type மரம்_மொழிபெயர்ப்பு_அகராதி_கிளை_வகை = {
  [சாபி: string]: மரம்_மொழிபெயர்ப்பு_அகராதி_கிளை_வகை | string;
};
export type மரம்_மொழிபெயர்ப்பு_அகராதி_வகை = {
  [மொழி: string]: மரம்_மொழிபெயர்ப்பு_அகராதி_கிளை_வகை;
};

// மொழியாக்க முன்னேற்றம்
export type முன்னேற்றம்_தகவல்கள் = {
  அங்கீகரிக்கப்பட்டவை: number;
  பரிந்துரைக்கப்பட்டவை: number;
  மொத்தம்: number;
};

// கிளிமூக்குக்காக தரவுத்தளம் உறுப்படி வகைகள்
export type அங்கீகரிக்கப்பட்ட_மொழிபெயர்ப்பு_உறுப்படி_வகை =
  அங்கீகரிக்கப்பட்ட_உறுப்படி_வகை<மொழிபெயர்ப்பு_பரிந்துரை_உறுப்படி_வகை>;

export type மொழிபெயர்ப்பு_பரிந்துரை_உறுப்படி_வகை = {
  [சாபி_நெடுவரிசை_அடையாளம்]: string;
  [மொழிபெயர்ப்பு_நெடுவரிசை_அடையாளம்]: string;
  [இலக்கு_மொழி_நெடுவரிசை_அடையாளம்]: string;
  [மூல்_மொழி_நெடுவரிசை_அடையாளம்]?: string;
  [மூல்_உரை_நெடுவரிசை_அடையாளம்]?: string;
};

export type அங்கீகரிக்கப்பட்ட_மொழிபெயர்ப்பு_வகை =
  மொழிபெயர்ப்பு_பரிந்துரை_வகை & {
    பங்கேற்பாளர்: string;
    கைரேகை: string;
  };

export type மொழிபெயர்ப்பு_பரிந்துரை_வகை = {
  சாபி: string;
  தேதி?: Date;
  மொழிபெயர்ப்பு: string;
  இலக்கு_மொழி: string;
  மூல்_மொழி?: string;
  மூல்_உரை?: string;
};

export type பிணையம்_மொழிபெயர்ப்பு_பரிந்துரை_வகை = {
  பங்கேற்பாளர்: string;
  அடையாளம்: string;
  பரிந்துரை: மொழிபெயர்ப்பு_பரிந்துரை_வகை;
};
