import { expect } from "aegir/chai";

import { ClientConstellation, générerClient } from "@constl/ipa";
import { client, attente } from "@constl/utils-tests";
import { கிளிமூக்கு, மொழிபெயர்ப்பு_அகராதி_வகை } from "@/குறியீட்டு.js";

const { générerClients } = client;

const தயாரிப்பு = async ({
  விண்மீன்,
  மூல்_மொழிபெயர்ப்புகள்,
}: {
  விண்மீன்: ClientConstellation;
  மூல்_மொழிபெயர்ப்புகள்: மொழிபெயர்ப்பு_அகராதி_வகை;
}) => {
  const குழு_அடையாளம் = await கிளிமூக்கு.உருவாக்கு({ விண்மீன் });
  return new கிளிமூக்கு({
    விண்மீன்,
    அடையாளம்: குழு_அடையாளம்,
    மூல்_மொழிபெயர்ப்புகள்,
  });
};

describe("கிளிமூக்கு", async () => {
  let விண்மீன்: ClientConstellation;
  const மறந்துவிடு: (() => Promise<void>)[] = [];

  before(async () => {
    const { clients: வாடிக்கையாளர்கள், fOublier: விண்மீனை_மறந்துவிடு } =
      await générerClients({ n: 1, générerClient });
    மறந்துவிடு.push(விண்மீனை_மறந்துவிடு);
    விண்மீன் = வாடிக்கையாளர்கள்[0];
  });

  after(async () => {
    return await Promise.all(மறந்துவிடு.map((செ) => செ()));
  });

  describe("சாபிகள்", async () => {
    let என்_கிளிமூக்கு: கிளிமூக்கு;

    const சாபிகள் = new attente.AttendreRésultat<string[]>();
    const செ_மறந்துவிடு: (() => Promise<void>)[] = [];

    before(async () => {
      என்_கிளிமூக்கு = await தயாரிப்பு({
        விண்மீன்,
        மூல்_மொழிபெயர்ப்புகள்: {
          "சாபி.முதல்": {
            த: "விண்மீன்",
            हिं: "तारामंडल",
          },
          "சாபி.இரண்டாவது": {
            த: "கிளிமூக்கு",
          },
        },
      });

      const சாபிகளை_மறந்துவிடு = await என்_கிளிமூக்கு.சாபிகளை_கேள்ளு({
        செ: (இ) => சாபிகள்.mettreÀJour(இ),
      });
      செ_மறந்துவிடு.push(சாபிகளை_மறந்துவிடு);
    });

    after(async () => {
      return await Promise.all(செ_மறந்துவிடு.map((செ) => செ()));
    });

    it("மூல் சாபிகள்", async () => {
      const மதிப்பு = await சாபிகள்.attendreExiste();
      expect(மதிப்பு).to.contain("சாபி.முதல்", "சாபி.இரண்டாவது");
    });

    it("புதுச அங்கீகரிக்கப்பட்ட மொழிபெயர்ப்பு")
    it("புதுச பரிந்துரைக்கப்பட்ட மொழிபெயர்ப்பு")
  });
  it("மொழிகளை_கேள்ளு");
  it("அங்கீகரிக்கப்பட்ட_மொழிபெயர்ப்புகளை_கேள்ளு");
  it("மொழிபெயர்ப்புகளை_கேள்ளு");
  it("மொழிபெயர்ப்பு_பரிந்துரைகளை_கேள்ளு");
  it("எனது_மொழிபெயர்ப்பு_பரிந்துரைகளை_கேள்ளு");
  it("முன்னேற்றத்தை_கேள்ளு");
  it("மொழிபெயர்ப்பை_பரிந்துரையு");
  it("பேசு");
});
