import { expect } from "aegir/chai";
describe("மொழிபெயர்ப்பு_உறுப்படியிலிருந்து_மொழிபெயர்ப்பு_முடிவு", async () => {
  it("சோதனை");
});
describe("பரிந்துரை_உறுப்படியிலிருந்து_பரிந்துரை_முடிவு", async () => {
  it("சோதனை");
});
describe("மொழிபெயர்ப்பு_பட்டியலிலிருந்து_அரகாதி", async () => {
  it("சோதனை");
});
describe("மொழிபெயர்ப்புகளை_ஒன்றாக்கு", async () => {
  it("சோதனை");
});
describe("மொழிபெயர்ப்பு_அகராதியிலிருந்து_மரம்", async () => {
  it("சோதனை");
});
describe("மரத்திலிருந்து_மொழிபெயர்ப்பு_அகராதி", async () => {
  it("சோதனை");
});





